In [1]:
import pandas as pd

/Users/jisha/.pyenv/versions/3.8.6/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

## Clean Datasets

### FMR0

In [2]:
fmr0 = pd.read_csv('csv/fmr0.csv')

In [3]:
print(fmr0.shape)
fmr0.head()

(3228, 9)

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,587,588,581,583,640,"Montgomery, AL"
1,METRO19300M19300,Daphne,AL,807,729,756,744,718,"Daphne, AL"
2,METRO19300M19300,Fairhope,AL,807,729,756,744,718,"Fairhope, AL"
3,METRO19300M19300,Foley,AL,807,729,756,744,718,"Foley, AL"
4,METRO13820M13820,Birmingham,AL,665,692,706,804,817,"Birmingham, AL"

In [4]:
fmr0[fmr0.duplicated(subset=['city, state'], keep=False)]

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,587,588,581,583,640,"Montgomery, AL"
4,METRO13820M13820,Birmingham,AL,665,692,706,804,817,"Birmingham, AL"
5,METRO13820M13820,Hoover,AL,665,692,706,804,817,"Hoover, AL"
6,METRO13820M13820,Birmingham,AL,665,692,706,804,817,"Birmingham, AL"
7,METRO13820M13820,Hoover,AL,665,692,706,804,817,"Hoover, AL"
...,...,...,...,...,...,...,...,...,...
3223,METRO41980MM7440,Guaynabo,PR,430,415,431,416,436,"Guaynabo, PR"
3224,METRO38660M38660,Ponce,PR,377,371,398,377,384,"Ponce, PR"
3225,METRO41980MM7440,San Juan,PR,430,415,431,416,436,"San Juan, PR"
3226,METRO41980MM7440,Guaynabo,PR,430,415,431,416,436,"Guaynabo, PR"
3227,METRO38660M49500,Yauco,PR,357,323,354,349,361,"Yauco, PR"

In [5]:
fmr0 = fmr0.drop_duplicates(subset=['city, state' ], keep='last')
print(fmr0.shape)

(910, 9)

### FMR1

In [6]:
fmr1 = pd.read_csv('csv/fmr1.csv')

In [7]:
print(fmr1.shape)
fmr1.head()

(3228, 9)

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,682,691,696,702,766,"Montgomery, AL"
1,METRO19300M19300,Daphne,AL,847,762,773,749,723,"Daphne, AL"
2,METRO19300M19300,Fairhope,AL,847,762,773,749,723,"Fairhope, AL"
3,METRO19300M19300,Foley,AL,847,762,773,749,723,"Foley, AL"
4,METRO13820M13820,Birmingham,AL,751,768,763,861,871,"Birmingham, AL"

In [8]:
fmr1[fmr1.duplicated(subset=['city, state'], keep=False)]

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,682,691,696,702,766,"Montgomery, AL"
4,METRO13820M13820,Birmingham,AL,751,768,763,861,871,"Birmingham, AL"
5,METRO13820M13820,Hoover,AL,751,768,763,861,871,"Hoover, AL"
6,METRO13820M13820,Birmingham,AL,751,768,763,861,871,"Birmingham, AL"
7,METRO13820M13820,Hoover,AL,751,768,763,861,871,"Hoover, AL"
...,...,...,...,...,...,...,...,...,...
3223,METRO41980MM7440,Guaynabo,PR,459,439,459,451,477,"Guaynabo, PR"
3224,METRO38660M38660,Ponce,PR,395,381,408,388,393,"Ponce, PR"
3225,METRO41980MM7440,San Juan,PR,459,439,459,451,477,"San Juan, PR"
3226,METRO41980MM7440,Guaynabo,PR,459,439,459,451,477,"Guaynabo, PR"
3227,METRO38660M49500,Yauco,PR,374,337,363,359,369,"Yauco, PR"

In [9]:
fmr1 = fmr1.drop_duplicates(subset=['city, state' ], keep='last')
print(fmr1.shape)

(910, 9)

### FMR2

In [10]:
fmr2 = pd.read_csv('csv/fmr2.csv')

In [11]:
print(fmr2.shape)
fmr2.head()

(3228, 9)

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,822,829,825,830,908,"Montgomery, AL"
1,METRO19300M19300,Daphne,AL,977,879,888,916,922,"Daphne, AL"
2,METRO19300M19300,Fairhope,AL,977,879,888,916,922,"Fairhope, AL"
3,METRO19300M19300,Foley,AL,977,879,888,916,922,"Foley, AL"
4,METRO13820M13820,Birmingham,AL,866,882,873,986,1002,"Birmingham, AL"

In [12]:
fmr2[fmr2.duplicated(subset=['city, state'], keep=False)]

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,822,829,825,830,908,"Montgomery, AL"
4,METRO13820M13820,Birmingham,AL,866,882,873,986,1002,"Birmingham, AL"
5,METRO13820M13820,Hoover,AL,866,882,873,986,1002,"Hoover, AL"
6,METRO13820M13820,Birmingham,AL,866,882,873,986,1002,"Birmingham, AL"
7,METRO13820M13820,Hoover,AL,866,882,873,986,1002,"Hoover, AL"
...,...,...,...,...,...,...,...,...,...
3223,METRO41980MM7440,Guaynabo,PR,553,530,549,531,556,"Guaynabo, PR"
3224,METRO38660M38660,Ponce,PR,456,438,467,442,448,"Ponce, PR"
3225,METRO41980MM7440,San Juan,PR,553,530,549,531,556,"San Juan, PR"
3226,METRO41980MM7440,Guaynabo,PR,553,530,549,531,556,"Guaynabo, PR"
3227,METRO38660M49500,Yauco,PR,432,389,416,409,421,"Yauco, PR"

In [13]:
fmr2 = fmr2.drop_duplicates(subset=['city, state' ], keep='last')
print(fmr2.shape)

(910, 9)

### FMR3

In [14]:
fmr3 = pd.read_csv('csv/fmr3.csv')

In [15]:
print(fmr3.shape)
fmr3.head()

(3228, 9)

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,1054,1055,1043,1047,1148,"Montgomery, AL"
1,METRO19300M19300,Daphne,AL,1422,1280,1252,1251,1249,"Daphne, AL"
2,METRO19300M19300,Fairhope,AL,1422,1280,1252,1251,1249,"Fairhope, AL"
3,METRO19300M19300,Foley,AL,1422,1280,1252,1251,1249,"Foley, AL"
4,METRO13820M13820,Birmingham,AL,1163,1176,1154,1291,1303,"Birmingham, AL"

In [16]:
fmr3[fmr3.duplicated(subset=['city, state'], keep=False)]

,metro_code,areaname,state_alpha,2017,2018,2019,2020,2021,"city, state"
0,METRO33860M33860,Montgomery,AL,1054,1055,1043,1047,1148,"Montgomery, AL"
4,METRO13820M13820,Birmingham,AL,1163,1176,1154,1291,1303,"Birmingham, AL"
5,METRO13820M13820,Hoover,AL,1163,1176,1154,1291,1303,"Hoover, AL"
6,METRO13820M13820,Birmingham,AL,1163,1176,1154,1291,1303,"Birmingham, AL"
7,METRO13820M13820,Hoover,AL,1163,1176,1154,1291,1303,"Hoover, AL"
...,...,...,...,...,...,...,...,...,...
3223,METRO41980MM7440,Guaynabo,PR,743,706,728,706,740,"Guaynabo, PR"
3224,METRO38660M38660,Ponce,PR,664,637,675,638,641,"Ponce, PR"
3225,METRO41980MM7440,San Juan,PR,743,706,728,706,740,"San Juan, PR"
3226,METRO41980MM7440,Guaynabo,PR,743,706,728,706,740,"Guaynabo, PR"
3227,METRO38660M49500,Yauco,PR,555,501,575,567,596,"Yauco, PR"

In [17]:
fmr3 = fmr3.drop_duplicates(subset=['city, state' ], keep='last')
print(fmr3.shape)

(910, 9)

### Save FMR

In [18]:
fmr0.to_csv('csv/fmr0.csv', index=False)
fmr1.to_csv('csv/fmr1.csv', index=False)
fmr2.to_csv('csv/fmr2.csv', index=False)
fmr3.to_csv('csv/fmr3.csv', index=False)

### Create updated melts for ease of cleaning rather than rerunning the entire notebook

In [19]:
fmr0_melt = fmr0.copy()
fmr0_melt = fmr0_melt.drop(columns=['metro_code', 'areaname', 'state_alpha'])

In [20]:
fmr1_melt = fmr1.copy()
fmr1_melt = fmr1_melt.drop(columns=['metro_code', 'areaname', 'state_alpha'])

In [21]:
fmr2_melt = fmr2.copy()
fmr2_melt = fmr2_melt.drop(columns=['metro_code', 'areaname', 'state_alpha'])

In [22]:
fmr3_melt = fmr3.copy()
fmr3_melt = fmr3_melt.drop(columns=['metro_code', 'areaname', 'state_alpha'])

In [23]:
# to get in the form prophet needs
fmr0_melt = (fmr0_melt.melt(id_vars=['city, state'], 
                         var_name='ds', 
                         value_name='y')
                         ).reset_index(drop=True)

In [24]:
fmr0_melt.head()

    city, state    ds    y
0    Daphne, AL  2017  807
1  Fairhope, AL  2017  807
2     Foley, AL  2017  807
3  Anniston, AL  2017  437
4    Oxford, AL  2017  437

In [25]:
# to get in the form prophet needs
fmr1_melt = (fmr1_melt.melt(id_vars=['city, state'], 
                         var_name='ds', 
                         value_name='y')
                         ).reset_index(drop=True)

In [26]:
fmr1_melt.head()

    city, state    ds    y
0    Daphne, AL  2017  847
1  Fairhope, AL  2017  847
2     Foley, AL  2017  847
3  Anniston, AL  2017  474
4    Oxford, AL  2017  474

In [27]:
# to get in the form prophet needs
fmr2_melt = (fmr2_melt.melt(id_vars=['city, state'], 
                         var_name='ds', 
                         value_name='y')
                         ).reset_index(drop=True)

In [28]:
fmr2_melt.head()

    city, state    ds    y
0    Daphne, AL  2017  977
1  Fairhope, AL  2017  977
2     Foley, AL  2017  977
3  Anniston, AL  2017  630
4    Oxford, AL  2017  630

In [29]:
# to get in the form prophet needs
fmr3_melt = (fmr3_melt.melt(id_vars=['city, state'], 
                         var_name='ds', 
                         value_name='y')
                         ).reset_index(drop=True)

In [30]:
fmr3_melt.head()

    city, state    ds     y
0    Daphne, AL  2017  1422
1  Fairhope, AL  2017  1422
2     Foley, AL  2017  1422
3  Anniston, AL  2017   818
4    Oxford, AL  2017   818

In [31]:
fmr0_melt.to_csv('csv/fmr0_melt.csv', index=False)
fmr1_melt.to_csv('csv/fmr1_melt.csv', index=False)
fmr2_melt.to_csv('csv/fmr2_melt.csv', index=False)
fmr3_melt.to_csv('csv/fmr3_melt.csv', index=False)